Revit 2027 API
Document.GetPrintSettingIds Method
 Retrieves all Print Settings of current project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetPrintSettingIds()
Public Function GetPrintSettingIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetPrintSettingIds()
member GetPrintSettingIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
The ElementIds of all print setting elements
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace